Table of Contents
 Class SteelSetup
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
ISteelSetup
[KnownType(typeof(SteelSetupECEN))]
[KnownType(typeof(SteelSetupAISC))]
[KnownType(typeof(SteelSetupCISC))]
[KnownType(typeof(SteelSetupAUS))]
[KnownType(typeof(SteelSetupRUS))]
[KnownType(typeof(SteelSetupIND))]
[KnownType(typeof(SteelSetupHKG))]
public abstract class SteelSetup
Inheritance
object
SteelSetup
Derived
SteelSetupAISC
SteelSetupAUS
SteelSetupCISC
SteelSetupECEN
SteelSetupHKG
SteelSetupIND
SteelSetupRUS
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Methods
 FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
public virtual double FrictionCoefficientPboltDefault()
Returns
double
 Edit this page